{"id":"surah_21","tssurah":"import { TYPE } from '../types/islam';export const surah_21: TYPE = {ayah_1: {image: '',text: '[The time of] their account has approached for the people, while they are in heedlessness turning away.',verse: 2353,},ayah_2: {image: '',text: 'No mention comes to them anew from their Lord except that they listen to it while they are at play',verse: 2354,},ayah_3: {image: '',text: 'With their hearts distracted. And those who do wrong conceal their private conversation, [saying], \"Is this [Prophet] except a human being like you? So would you approach magic while you are aware [of it]?\"',verse: 2355,},ayah_4: {image: '',text: 'The Prophet said, \"My Lord knows whatever is said throughout the heaven and earth, and He is the Hearing, the Knowing.\"',verse: 2356,},ayah_5: {image: '',text: 'But they say, \"[The revelation is but] a mixture of false dreams; rather, he has invented it; rather, he is a poet. So let him bring us a sign just as the previous [messengers] were sent [with miracles].\"',verse: 2357,},ayah_6: {image: '',text: 'Not a [single] city which We destroyed believed before them, so will they believe?',verse: 2358,},ayah_7: {image: '',text: 'And We sent not before you, [O Muhammad], except men to whom We revealed [the message], so ask the people of the message if you do not know.',verse: 2359,},ayah_8: {image: '',text: 'And We did not make the prophets forms not eating food, nor were they immortal [on earth].',verse: 2360,},ayah_9: {image: '',text: 'Then We fulfilled for them the promise, and We saved them and whom We willed and destroyed the transgressors.',verse: 2361,},ayah_10: {image: '',text: 'We have certainly sent down to you a Book in which is your mention. Then will you not reason?',verse: 2362,},ayah_11: {image: '',text: 'And how many a city which was unjust have We shattered and produced after it another people.',verse: 2363,},ayah_12: {image: '',text: 'And when its inhabitants perceived Our punishment, at once they fled from it.',verse: 2364,},ayah_13: {image: '',text: '[Some angels said], \"Do not flee but return to where you were given luxury and to your homes -  perhaps you will be questioned.\"',verse: 2365,},ayah_14: {image: '',text: 'They said, \"O woe to us! Indeed, we were wrongdoers.\"',verse: 2366,},ayah_15: {image: '',text: 'And that declaration of theirs did not cease until We made them [as] a harvest [mowed down], extinguished [like a fire].',verse: 2367,},ayah_16: {image: '',text: 'And We did not create the heaven and earth and that between them in play.',verse: 2368,},ayah_17: {image: '',text: 'Had We intended to take a diversion, We could have taken it from [what is] with Us - if [indeed] We were to do so.',verse: 2369,},ayah_18: {image: '',text: 'Rather, We dash the truth upon falsehood, and it destroys it, and thereupon it departs. And for you is destruction from that which you describe.',verse: 2370,},ayah_19: {image: '',text: 'To Him belongs whoever is in the heavens and the earth. And those near Him are not prevented by arrogance from His worship, nor do they tire.',verse: 2371,},ayah_20: {image: '',text: 'They exalt [Him] night and day [and] do not slacken.',verse: 2372,},ayah_21: {image: '',text: 'Or have men taken for themselves gods from the earth who resurrect [the dead]?',verse: 2373,},ayah_22: {image: '',text: 'Had there been within the heavens and earth gods besides Allah, they both would have been ruined. So exalted is Allah, Lord of the Throne, above what they describe.',verse: 2374,},ayah_23: {image: '',text: 'He is not questioned about what He does, but they will be questioned.',verse: 2375,},ayah_24: {image: '',text: 'Or have they taken gods besides Him? Say, [O Muhammad], \"Produce your proof. This [Qur'an] is the message for those with me and the message of those before me.\" But most of them do not know the truth, so they are turning away.',verse: 2376,},ayah_25: {image: '',text: 'And We sent not before you any messenger except that We revealed to him that, \"There is no deity except Me, so worship Me.\"',verse: 2377,},ayah_26: {image: '',text: 'And they say, \"The Most Merciful has taken a son.\" Exalted is He! Rather, they are [but] honored servants.',verse: 2378,},ayah_27: {image: '',text: 'They cannot precede Him in word, and they act by His command.',verse: 2379,},ayah_28: {image: '',text: 'He knows what is [presently] before them and what will be after them, and they cannot intercede except on behalf of one whom He approves. And they, from fear of Him, are apprehensive.',verse: 2380,},ayah_29: {image: '',text: 'And whoever of them should say, \"Indeed, I am a god besides Him\"-  that one We would recompense with Hell. Thus do We recompense the wrongdoers.',verse: 2381,},ayah_30: {image: '',text: 'Have those who disbelieved not considered that the heavens and the earth were a joined entity, and We separated them and made from water every living thing? Then will they not believe?',verse: 2382,},ayah_31: {image: '',text: 'And We placed within the earth firmly set mountains, lest it should shift with them, and We made therein [mountain] passes [as] roads that they might be guided.',verse: 2383,},ayah_32: {image: '',text: 'And We made the sky a protected ceiling, but they, from its signs, are turning away.',verse: 2384,},ayah_33: {image: '',text: 'And it is He who created the night and the day and the sun and the moon; all [heavenly bodies] in an orbit are swimming.',verse: 2385,},ayah_34: {image: '',text: 'And We did not grant to any man before you eternity [on earth]; so if you die -  would they be eternal?',verse: 2386,},ayah_35: {image: '',text: 'Every soul will taste death. And We test you with evil and with good as trial; and to Us you will be returned.',verse: 2387,},ayah_36: {image: '',text: 'And when those who disbelieve see you, [O Muhammad], they take you not except in ridicule, [saying], \"Is this the one who insults your gods?\" And they are, at the mention of the Most Merciful, disbelievers.',verse: 2388,},ayah_37: {image: '',text: 'Man was created of haste. I will show you My signs, so do not impatiently urge Me.',verse: 2389,},ayah_38: {image: '',text: 'And they say, \"When is this promise, if you should be truthful?\"',verse: 2390,},ayah_39: {image: '',text: 'If those who disbelieved but knew the time when they will not avert the Fire from their faces or from their backs and they will not be aided...',verse: 2391,},ayah_40: {image: '',text: 'Rather, it will come to them unexpectedly and bewilder them, and they will not be able to repel it, nor will they be reprieved.',verse: 2392,},ayah_41: {image: '',text: 'And already were messengers ridiculed before you, but those who mocked them were enveloped by what they used to ridicule.',verse: 2393,},ayah_42: {image: '',text: 'Say, \"Who can protect you at night or by day from the Most Merciful?\" But they are, from the remembrance of their Lord, turning away.',verse: 2394,},ayah_43: {image: '',text: 'Or do they have gods to defend them other than Us? They are unable [even] to help themselves, nor can they be protected from Us.',verse: 2395,},ayah_44: {image: '',text: 'But, [on the contrary], We have provided good things for these [disbelievers] and their fathers until life was prolonged for them. Then do they not see that We set upon the land, reducing it from its borders? So it is they who will overcome?',verse: 2396,},ayah_45: {image: '',text: 'Say, \"I only warn you by revelation.\" But the deaf do not hear the call when they are warned.',verse: 2397,},ayah_46: {image: '',text: 'And if [as much as] a whiff of the punishment of your Lord should touch them, they would surely say, \"O woe to us! Indeed, we have been wrongdoers.\"',verse: 2398,},ayah_47: {image: '',text: 'And We place the scales of justice for the Day of Resurrection, so no soul will be treated unjustly at all. And if there is [even] the weight of a mustard seed, We will bring it forth. And sufficient are We as accountant.',verse: 2399,},ayah_48: {image: '',text: 'And We had already given Moses and Aaron the criterion and a light and a reminder for the righteous',verse: 2400,},ayah_49: {image: '',text: 'Who fear their Lord unseen, while they are of the Hour apprehensive.',verse: 2401,},ayah_50: {image: '',text: 'And this [Qur'an] is a blessed message which We have sent down. Then are you with it unacquainted?',verse: 2402,},ayah_51: {image: '',text: 'And We had certainly given Abraham his sound judgement before, and We were of him well-Knowing',verse: 2403,},ayah_52: {image: '',text: 'When he said to his father and his people, \"What are these statues to which you are devoted?\"',verse: 2404,},ayah_53: {image: '',text: 'They said, \"We found our fathers worshippers of them.\"',verse: 2405,},ayah_54: {image: '',text: 'He said, \"You were certainly, you and your fathers, in manifest error.\"',verse: 2406,},ayah_55: {image: '',text: 'They said, \"Have you come to us with truth, or are you of those who jest?\"',verse: 2407,},ayah_56: {image: '',text: 'He said, \"[No], rather, your Lord is the Lord of the heavens and the earth who created them, and I, to that, am of those who testify.',verse: 2408,},ayah_57: {image: '',text: 'And [I swear] by Allah, I will surely plan against your idols after you have turned and gone away.\"',verse: 2409,},ayah_58: {image: '',text: 'So he made them into fragments, except a large one among them, that they might return to it [and question].',verse: 2410,},ayah_59: {image: '',text: 'They said, \"Who has done this to our gods? Indeed, he is of the wrongdoers.\"',verse: 2411,},ayah_60: {image: '',text: 'They said, \"We heard a young man mention them who is called Abraham.\"',verse: 2412,},ayah_61: {image: '',text: 'They said, \"Then bring him before the eyes of the people that they may testify.\"',verse: 2413,},ayah_62: {image: '',text: 'They said, \"Have you done this to our gods, O Abraham?\"',verse: 2414,},ayah_63: {image: '',text: 'He said, \"Rather, this -  the largest of them -  did it, so ask them, if they should [be able to] speak.\"',verse: 2415,},ayah_64: {image: '',text: 'So they returned to [blaming] themselves and said [to each other], \"Indeed, you are the wrongdoers.\"',verse: 2416,},ayah_65: {image: '',text: 'Then they reversed themselves, [saying], \"You have already known that these do not speak!\"',verse: 2417,},ayah_66: {image: '',text: 'He said, \"Then do you worship instead of Allah that which does not benefit you at all or harm you?',verse: 2418,},ayah_67: {image: '',text: 'Uff to you and to what you worship instead of Allah . Then will you not use reason?\"',verse: 2419,},ayah_68: {image: '',text: 'They said, \"Burn him and support your gods -  if you are to act.\"',verse: 2420,},ayah_69: {image: '',text: 'Allah said, \"O fire, be coolness and safety upon Abraham.\"',verse: 2421,},ayah_70: {image: '',text: 'And they intended for him harm, but We made them the greatest losers.',verse: 2422,},ayah_71: {image: '',text: 'And We delivered him and Lot to the land which We had blessed for the worlds.',verse: 2423,},ayah_72: {image: '',text: 'And We gave him Isaac and Jacob in addition, and all [of them] We made righteous.',verse: 2424,},ayah_73: {image: '',text: 'And We made them leaders guiding by Our command. And We inspired to them the doing of good deeds, establishment of prayer, and giving of zakah; and they were worshippers of Us.',verse: 2425,},ayah_74: {image: '',text: 'And to Lot We gave judgement and knowledge, and We saved him from the city that was committing wicked deeds. Indeed, they were a people of evil, defiantly disobedient.',verse: 2426,},ayah_75: {image: '',text: 'And We admitted him into Our mercy. Indeed, he was of the righteous.',verse: 2427,},ayah_76: {image: '',text: 'And [mention] Noah, when he called [to Allah ] before [that time], so We responded to him and saved him and his family from the great flood.',verse: 2428,},ayah_77: {image: '',text: 'And We saved him from the people who denied Our signs. Indeed, they were a people of evil, so We drowned them, all together.',verse: 2429,},ayah_78: {image: '',text: 'And [mention] David and Solomon, when they judged concerning the field - when the sheep of a people overran it [at night], and We were witness to their judgement.',verse: 2430,},ayah_79: {image: '',text: 'And We gave understanding of the case to Solomon, and to each [of them] We gave judgement and knowledge. And We subjected the mountains to exalt [Us], along with David and [also] the birds. And We were doing [that].',verse: 2431,},ayah_80: {image: '',text: 'And We taught him the fashioning of coats of armor to protect you from your [enemy in] battle. So will you then be grateful?',verse: 2432,},ayah_81: {image: '',text: 'And to Solomon [We subjected] the wind, blowing forcefully, proceeding by his command toward the land which We had blessed. And We are ever, of all things, Knowing.',verse: 2433,},ayah_82: {image: '',text: 'And of the devils were those who dived for him and did work other than that. And We were of them a guardian.',verse: 2434,},ayah_83: {image: '',text: 'And [mention] Job, when he called to his Lord, \"Indeed, adversity has touched me, and you are the Most Merciful of the merciful.\"',verse: 2435,},ayah_84: {image: '',text: 'So We responded to him and removed what afflicted him of adversity. And We gave him [back] his family and the like thereof with them as mercy from Us and a reminder for the worshippers [of Allah ].',verse: 2436,},ayah_85: {image: '',text: 'And [mention] Ishmael and Idrees and Dhul-Kifl; all were of the patient.',verse: 2437,},ayah_86: {image: '',text: 'And We admitted them into Our mercy. Indeed, they were of the righteous.',verse: 2438,},ayah_87: {image: '',text: 'And [mention] the man of the fish, when he went off in anger and thought that We would not decree [anything] upon him. And he called out within the darknesses, \"There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.\"',verse: 2439,},ayah_88: {image: '',text: 'So We responded to him and saved him from the distress. And thus do We save the believers.',verse: 2440,},ayah_89: {image: '',text: 'And [mention] Zechariah, when he called to his Lord, \"My Lord, do not leave me alone [with no heir], while you are the best of inheritors.\"',verse: 2441,},ayah_90: {image: '',text: 'So We responded to him, and We gave to him John, and amended for him his wife. Indeed, they used to hasten to good deeds and supplicate Us in hope and fear, and they were to Us humbly submissive.',verse: 2442,},ayah_91: {image: '',text: 'And [mention] the one who guarded her chastity, so We blew into her [garment] through Our angel [Gabriel], and We made her and her son a sign for the worlds.',verse: 2443,},ayah_92: {image: '',text: 'Indeed this, your religion, is one religion, and I am your Lord, so worship Me.',verse: 2444,},ayah_93: {image: '',text: 'And [yet] they divided their affair among themselves, [but] all to Us will return.',verse: 2445,},ayah_94: {image: '',text: 'So whoever does righteous deeds while he is a believer -  no denial will there be for his effort, and indeed We, of it, are recorders.',verse: 2446,},ayah_95: {image: '',text: 'And there is prohibition upon [the people of] a city which We have destroyed that they will [ever] return',verse: 2447,},ayah_96: {image: '',text: 'Until when [the dam of] Gog and Magog has been opened and they, from every elevation, descend',verse: 2448,},ayah_97: {image: '',text: 'And [when] the true promise has approached; then suddenly the eyes of those who disbelieved will be staring [in horror, while they say], \"O woe to us; we had been unmindful of this; rather, we were wrongdoers.\"',verse: 2449,},ayah_98: {image: '',text: 'Indeed, you [disbelievers] and what you worship other than Allah are the firewood of Hell. You will be coming to [enter] it.',verse: 2450,},ayah_99: {image: '',text: 'Had these [false deities] been [actual] gods, they would not have come to it, but all are eternal therein.',verse: 2451,},ayah_100: {image: '',text: 'For them therein is heavy sighing, and they therein will not hear.',verse: 2452,},ayah_101: {image: '',text: 'Indeed, those for whom the best [reward] has preceded from Us -  they are from it far removed.',verse: 2453,},ayah_102: {image: '',text: 'They will not hear its sound, while they are, in that which their souls desire, abiding eternally.',verse: 2454,},ayah_103: {image: '',text: 'They will not be grieved by the greatest terror, and the angels will meet them, [saying], \"This is your Day which you have been promised\" -',verse: 2455,},ayah_104: {image: '',text: 'The Day when We will fold the heaven like the folding of a [written] sheet for the records. As We began the first creation, We will repeat it. [That is] a promise binding upon Us. Indeed, We will do it.',verse: 2456,},ayah_105: {image: '',text: 'And We have already written in the book [of Psalms] after the [previous] mention that the land [of Paradise] is inherited by My righteous servants.',verse: 2457,},ayah_106: {image: '',text: 'Indeed, in this [Qur'an] is notification for a worshipping people.',verse: 2458,},ayah_107: {image: '',text: 'And We have not sent you, [O Muhammad], except as a mercy to the worlds.',verse: 2459,},ayah_108: {image: '',text: 'Say, \"It is only revealed to me that your god is but one God; so will you be Muslims [in submission to Him]?\"',verse: 2460,},ayah_109: {image: '',text: 'But if they turn away, then say, \"I have announced to [all of] you equally. And I know not whether near or far is that which you are promised.',verse: 2461,},ayah_110: {image: '',text: 'Indeed, He knows what is declared of speech, and He knows what you conceal.',verse: 2462,},ayah_111: {image: '',text: 'And I know not; perhaps it is a trial for you and enjoyment for a time.\"',verse: 2463,},ayah_112: {image: '',text: '[The Prophet] has said, \"My Lord, judge [between us] in truth. And our Lord is the Most Merciful, the one whose help is sought against that which you describe.\"',verse: 2464,},name: surah_21,};"}
