{"id":"surah_6","tssurah":"import { TYPE } from '../types/islam';export const surah_6: TYPE = {ayah_1: {image: '',text: '[All] praise is [due] to Allah, who created the heavens and the earth and made the darkness and the light. Then those who disbelieve equate [others] with their Lord.',verse: 776,},ayah_2: {image: '',text: 'It is He who created you from clay and then decreed a term and a specified time [known] to Him; then [still] you are in dispute.',verse: 777,},ayah_3: {image: '',text: 'And He is Allah, [the only deity] in the heavens and the earth. He knows your secret and what you make public, and He knows that which you earn.',verse: 778,},ayah_4: {image: '',text: 'And no sign comes to them from the signs of their Lord except that they turn away therefrom.',verse: 779,},ayah_5: {image: '',text: 'For they had denied the truth when it came to them, but there is going to reach  them the news of what they used to ridicule.',verse: 780,},ayah_6: {image: '',text: 'Have they not seen how many generations We destroyed before them which We had established upon the earth as We have not established you? And We sent [rain from] the sky upon them in showers and made rivers flow beneath them; then We destroyed them for their sins and brought forth after them a generation of others.',verse: 781,},ayah_7: {image: '',text: 'And even if We had sent down to you, [O Muhammad], a written scripture on a page and they touched it with their hands, the disbelievers would say, \"This is not but obvious magic.\"',verse: 782,},ayah_8: {image: '',text: 'And they say, \"Why was there not sent down to him an angel?\" But if We had sent down an angel, the matter would have been decided; then they would not be reprieved.',verse: 783,},ayah_9: {image: '',text: 'And if We had made him an angel, We would have made him [appear as] a man, and We would have covered them with that in which they cover themselves.',verse: 784,},ayah_10: {image: '',text: 'And already were messengers ridiculed before you, but those who mocked them were enveloped by that which they used to ridicule.',verse: 785,},ayah_11: {image: '',text: 'Say, \"Travel through the land; then observe how was the end of the deniers.\"',verse: 786,},ayah_12: {image: '',text: 'Say, \"To whom belongs whatever is in the heavens and earth?\" Say, \"To Allah .\" He has decreed upon Himself mercy. He will surely assemble you for the Day of Resurrection, about which there is no doubt. Those who will lose themselves [that Day] do not believe.',verse: 787,},ayah_13: {image: '',text: 'And to Him belongs that which reposes by night and by day, and He is the Hearing, the Knowing.',verse: 788,},ayah_14: {image: '',text: 'Say, \"Is it other than Allah I should take as a protector, Creator of the heavens and the earth, while it is He who feeds and is not fed?\" Say, [O Muhammad], \"Indeed, I have been commanded to be the first [among you] who submit [to Allah ] and [was commanded], 'Do not ever be of the polytheists.' \"',verse: 789,},ayah_15: {image: '',text: 'Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"',verse: 790,},ayah_16: {image: '',text: 'He from whom it is averted that Day -  [ Allah ] has granted him mercy. And that is the clear attainment.',verse: 791,},ayah_17: {image: '',text: 'And if Allah should touch you with adversity, there is no remover of it except Him. And if He touches you with good -  then He is over all things competent.',verse: 792,},ayah_18: {image: '',text: 'And He is the subjugator over His servants. And He is the Wise, the Acquainted [with all].',verse: 793,},ayah_19: {image: '',text: 'Say, \"What thing is greatest in testimony?\" Say, \" Allah is witness between me and you. And this Qur'an was revealed to me that I may warn you thereby and whomever it reaches. Do you [truly] testify that with Allah there are other deities?\" Say, \"I will not testify [with you].\" Say, \"Indeed, He is but one God, and indeed, I am free of what you associate [with Him].\"',verse: 794,},ayah_20: {image: '',text: 'Those to whom We have given the Scripture recognize it as they recognize their [own] sons. Those who will lose themselves [in the Hereafter] do not believe.',verse: 795,},ayah_21: {image: '',text: 'And who is more unjust than one who invents about Allah a lie or denies His verses? Indeed, the wrongdoers will not succeed.',verse: 796,},ayah_22: {image: '',text: 'And [mention, O Muhammad], the Day We will gather them all together; then We will say to those who associated others with Allah, \"Where are your 'partners' that you used to claim [with Him]?\"',verse: 797,},ayah_23: {image: '',text: 'Then there will be no [excuse upon] examination except they will say, \"By Allah, our Lord, we were not those who associated.\"',verse: 798,},ayah_24: {image: '',text: 'See how they will lie about themselves. And lost from them will be what they used to invent.',verse: 799,},ayah_25: {image: '',text: 'And among them are those who listen to you, but We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if they should see every sign, they will not believe in it. Even when they come to you arguing with you, those who disbelieve say, \"This is not but legends of the former peoples.\"',verse: 800,},ayah_26: {image: '',text: 'And they prevent [others] from him and are [themselves] remote from him. And they do not destroy except themselves, but they perceive [it] not.',verse: 801,},ayah_27: {image: '',text: 'If you could but see when they are made to stand before the Fire and will say, \"Oh, would that we could be returned [to life on earth] and not deny the signs of our Lord and be among the believers.\"',verse: 802,},ayah_28: {image: '',text: 'But what they concealed before has [now] appeared to them. And even if they were returned, they would return to that which they were forbidden; and indeed, they are liars.',verse: 803,},ayah_29: {image: '',text: 'And they say, \"There is none but our worldly life, and we will not be resurrected.\"',verse: 804,},ayah_30: {image: '',text: 'If you could but see when they will be made to stand before their Lord. He will say, \"Is this not the truth?\" They will say, \"Yes, by our Lord.\" He will [then] say, \"So taste the punishment because you used to disbelieve.\"',verse: 805,},ayah_31: {image: '',text: 'Those will have lost who deny the meeting with Allah, until when the Hour [of resurrection] comes upon them unexpectedly, they will say, \"Oh, [how great is] our regret over what we neglected concerning it,\" while they bear their burdens on their backs. Unquestionably, evil is that which they bear.',verse: 806,},ayah_32: {image: '',text: 'And the worldly life is not but amusement and diversion; but the home of the Hereafter is best for those who fear Allah, so will you not reason?',verse: 807,},ayah_33: {image: '',text: 'We know that you, [O Muhammad], are saddened by what they say. And indeed, they do not call you untruthful, but it is the verses of Allah that the wrongdoers reject.',verse: 808,},ayah_34: {image: '',text: 'And certainly were messengers denied before you, but they were patient over [the effects of] denial, and they were harmed until Our victory came to them. And none can alter the words of Allah . And there has certainly come to you some information about the [previous] messengers.',verse: 809,},ayah_35: {image: '',text: 'And if their evasion is difficult for you, then if you are able to seek a tunnel into the earth or a stairway into the sky to bring them a sign, [then do so]. But if Allah had willed, He would have united them upon guidance. So never be of the ignorant.',verse: 810,},ayah_36: {image: '',text: 'Only those who hear will respond. But the dead - Allah will resurrect them; then to Him they will be returned.',verse: 811,},ayah_37: {image: '',text: 'And they say, \"Why has a sign not been sent down to him from his Lord?\" Say, \"Indeed, Allah is Able to send down a sign, but most of them do not know.\"',verse: 812,},ayah_38: {image: '',text: 'And there is no creature on [or within] the earth or bird that flies with its wings except [that they are] communities like you. We have not neglected in the Register a thing. Then unto their Lord they will be gathered.',verse: 813,},ayah_39: {image: '',text: 'But those who deny Our verses are deaf and dumb within darknesses. Whomever Allah wills -  He leaves astray; and whomever He wills -  He puts him on a straight path.',verse: 814,},ayah_40: {image: '',text: 'Say, \"Have you considered: if there came to you the punishment of Allah or there came to you the Hour -  is it other than Allah you would invoke, if you should be truthful?\"',verse: 815,},ayah_41: {image: '',text: 'No, it is Him [alone] you would invoke, and He would remove that for which you invoked Him if He willed, and you would forget what you associate [with Him].',verse: 816,},ayah_42: {image: '',text: 'And We have already sent [messengers] to nations before you, [O Muhammad]; then We seized them with poverty and hardship that perhaps they might humble themselves [to Us].',verse: 817,},ayah_43: {image: '',text: 'Then why, when Our punishment came to them, did they not humble themselves? But their hearts became hardened, and Satan made attractive to them that which they were doing.',verse: 818,},ayah_44: {image: '',text: 'So when they forgot that by which they had been reminded, We opened to them the doors of every [good] thing until, when they rejoiced in that which they were given, We seized them suddenly, and they were [then] in despair.',verse: 819,},ayah_45: {image: '',text: 'So the people that committed wrong were eliminated. And praise to Allah, Lord of the worlds.',verse: 820,},ayah_46: {image: '',text: 'Say, \"Have you considered: if Allah should take away your hearing and your sight and set a seal upon your hearts, which deity other than Allah could bring them [back] to you?\" Look how we diversify the verses; then they [still] turn away.',verse: 821,},ayah_47: {image: '',text: 'Say, \"Have you considered: if the punishment of Allah should come to you unexpectedly or manifestly, will any be destroyed but the wrongdoing people?\"',verse: 822,},ayah_48: {image: '',text: 'And We send not the messengers except as bringers of good tidings and warners. So whoever believes and reforms -  there will be no fear concerning them, nor will they grieve.',verse: 823,},ayah_49: {image: '',text: 'But those who deny Our verses -  the punishment will touch them for their defiant disobedience.',verse: 824,},ayah_50: {image: '',text: 'Say, [O Muhammad], \"I do not tell you that I have the depositories [containing the provision] of Allah or that I know the unseen, nor do I tell you that I am an angel. I only follow what is revealed to me.\" Say, \"Is the blind equivalent to the seeing? Then will you not give thought?\"',verse: 825,},ayah_51: {image: '',text: 'And warn by the Qur'an those who fear that they will be gathered before their Lord - for them besides Him will be no protector and no intercessor - that they might become righteous.',verse: 826,},ayah_52: {image: '',text: 'And do not send away those who call upon their Lord morning and afternoon, seeking His countenance. Not upon you is anything of their account and not upon them is anything of your account. So were you to send them away, you would [then] be of the wrongdoers.',verse: 827,},ayah_53: {image: '',text: 'And thus We have tried some of them through others that the disbelievers might say, \"Is it these whom Allah has favored among us?\" Is not Allah most knowing of those who are grateful?',verse: 828,},ayah_54: {image: '',text: 'And when those come to you who believe in Our verses, say, \"Peace be upon you. Your Lord has decreed upon Himself mercy: that any of you who does wrong out of ignorance and then repents after that and corrects himself - indeed, He is Forgiving and Merciful.\"',verse: 829,},ayah_55: {image: '',text: 'And thus do We detail the verses, and [thus] the way of the criminals will become evident.',verse: 830,},ayah_56: {image: '',text: 'Say, \"Indeed, I have been forbidden to worship those you invoke besides Allah .\" Say, \"I will not follow your desires, for I would then have gone astray, and I would not be of the [rightly] guided.\"',verse: 831,},ayah_57: {image: '',text: 'Say, \"Indeed, I am on clear evidence from my Lord, and you have denied it. I do not have that for which you are impatient. The decision is only for Allah . He relates the truth, and He is the best of deciders.\"',verse: 832,},ayah_58: {image: '',text: 'Say, \"If I had that for which you are impatient, the matter would have been decided between me and you, but Allah is most knowing of the wrongdoers.\"',verse: 833,},name: surah_6,};"}
