{"id":"surah_19","tssurah":"import { TYPE } from '../types/islam';export const surah_19: TYPE = {ayah_1: {image: '',text: 'Kaf, Ha, Ya, 'Ayn, Sad.',verse: 2120,},ayah_2: {image: '',text: '[This is] a mention of the mercy of your Lord to His servant Zechariah',verse: 2121,},ayah_3: {image: '',text: 'When he called to his Lord a private supplication.',verse: 2122,},ayah_4: {image: '',text: 'He said, \"My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.',verse: 2123,},ayah_5: {image: '',text: 'And indeed, I fear the successors after me, and my wife has been barren, so give me from Yourself an heir',verse: 2124,},ayah_6: {image: '',text: 'Who will inherit me and inherit from the family of Jacob. And make him, my Lord, pleasing [to You].\"',verse: 2125,},ayah_7: {image: '',text: '[He was told], \"O Zechariah, indeed We give you good tidings of a boy whose name will be John.  We have not assigned to any before [this] name.\"',verse: 2126,},ayah_8: {image: '',text: 'He said, \"My Lord, how will I have a boy when my wife has been barren and I have reached extreme old age?\"',verse: 2127,},ayah_9: {image: '',text: '[An angel] said, \"Thus [it will be]; your Lord says, 'It is easy for Me, for I created you before, while you were nothing.' \"',verse: 2128,},ayah_10: {image: '',text: '[Zechariah] said, \"My Lord, make for me a sign.\" He said, \"Your sign is that you will not speak to the people for three nights, [being] sound.\"',verse: 2129,},ayah_11: {image: '',text: 'So he came out to his people from the prayer chamber and signaled to them to exalt [ Allah ] in the morning and afternoon.',verse: 2130,},ayah_12: {image: '',text: '[ Allah ] said, \"O John, take the Scripture with determination.\" And We gave him judgement [while yet] a boy',verse: 2131,},ayah_13: {image: '',text: 'And affection from Us and purity, and he was fearing of Allah',verse: 2132,},ayah_14: {image: '',text: 'And dutiful to his parents, and he was not a disobedient tyrant.',verse: 2133,},ayah_15: {image: '',text: 'And peace be upon him the day he was born and the day he dies and the day he is raised alive.',verse: 2134,},ayah_16: {image: '',text: 'And mention, [O Muhammad], in the Book [the story of] Mary, when she withdrew from her family to a place toward the east.',verse: 2135,},ayah_17: {image: '',text: 'And she took, in seclusion from them, a screen. Then We sent to her Our Angel, and he represented himself to her as a well-proportioned man.',verse: 2136,},ayah_18: {image: '',text: 'She said, \"Indeed, I seek refuge in the Most Merciful from you, [so leave me], if you should be fearing of Allah .\"',verse: 2137,},ayah_19: {image: '',text: 'He said, \"I am only the messenger of your Lord to give you [news of] a pure boy.\"',verse: 2138,},ayah_20: {image: '',text: 'She said, \"How can I have a boy while no man has touched me and I have not been unchaste?\"',verse: 2139,},ayah_21: {image: '',text: 'He said, \"Thus [it will be]; your Lord says, 'It is easy for Me, and We will make him a sign to the people and a mercy from Us. And it is a matter [already] decreed.' \"',verse: 2140,},ayah_22: {image: '',text: 'So she conceived him, and she withdrew with him to a remote place.',verse: 2141,},ayah_23: {image: '',text: 'And the pains of childbirth drove her to the trunk of a palm tree. She said, \"Oh, I wish I had died before this and was in oblivion, forgotten.\"',verse: 2142,},ayah_24: {image: '',text: 'But he called her from below her, \"Do not grieve; your Lord has provided beneath you a stream.',verse: 2143,},ayah_25: {image: '',text: 'And shake toward you the trunk of the palm tree; it will drop upon you ripe, fresh dates.',verse: 2144,},ayah_26: {image: '',text: 'So eat and drink and be contented. And if you see from among humanity anyone, say, 'Indeed, I have vowed to the Most Merciful abstention, so I will not speak today to [any] man.' \"',verse: 2145,},ayah_27: {image: '',text: 'Then she brought him to her people, carrying him. They said, \"O Mary, you have certainly done a thing unprecedented.',verse: 2146,},ayah_28: {image: '',text: 'O sister of Aaron, your father was not a man of evil, nor was your mother unchaste.\"',verse: 2147,},ayah_29: {image: '',text: 'So she pointed to him. They said, \"How can we speak to one who is in the cradle a child?\"',verse: 2148,},ayah_30: {image: '',text: '[Jesus] said, \"Indeed, I am the servant of Allah . He has given me the Scripture and made me a prophet.',verse: 2149,},ayah_31: {image: '',text: 'And He has made me blessed wherever I am and has enjoined upon me prayer and zakah as long as I remain alive',verse: 2150,},ayah_32: {image: '',text: 'And [made me] dutiful to my mother, and He has not made me a wretched tyrant.',verse: 2151,},ayah_33: {image: '',text: 'And peace is on me the day I was born and the day I will die and the day I am raised alive.\"',verse: 2152,},ayah_34: {image: '',text: 'That is Jesus, the son of Mary -  the word of truth about which they are in dispute.',verse: 2153,},ayah_35: {image: '',text: 'It is not [befitting] for Allah to take a son; exalted is He!  When He decrees an affair, He only says to it, \"Be,\" and it is.',verse: 2154,},ayah_36: {image: '',text: '[Jesus said], \"And indeed, Allah is my Lord and your Lord, so worship Him. That is a straight path.\"',verse: 2155,},ayah_37: {image: '',text: 'Then the factions differed [concerning Jesus] from among them, so woe to those who disbelieved -  from the scene of a tremendous Day.',verse: 2156,},ayah_38: {image: '',text: 'How [clearly] they will hear and see the Day they come to Us, but the wrongdoers today are in clear error.',verse: 2157,},ayah_39: {image: '',text: 'And warn them, [O Muhammad], of the Day of Regret, when the matter will be concluded; and [yet], they are in [a state of] heedlessness, and they do not believe.',verse: 2158,},ayah_40: {image: '',text: 'Indeed, it is We who will inherit the earth and whoever is on it, and to Us they will be returned.',verse: 2159,},ayah_41: {image: '',text: 'And mention in the Book [the story of] Abraham. Indeed, he was a man of truth and a prophet.',verse: 2160,},ayah_42: {image: '',text: '[Mention] when he said to his father, \"O my father, why do you worship that which does not hear and does not see and will not benefit you at all?',verse: 2161,},ayah_43: {image: '',text: 'O my father, indeed there has come to me of knowledge that which has not come to you, so follow me; I will guide you to an even path.',verse: 2162,},ayah_44: {image: '',text: 'O my father, do not worship Satan. Indeed Satan has ever been, to the Most Merciful, disobedient.',verse: 2163,},ayah_45: {image: '',text: 'O my father, indeed I fear that there will touch you a punishment from the Most Merciful so you would be to Satan a companion [in Hellfire].\"',verse: 2164,},ayah_46: {image: '',text: '[His father] said, \"Have you no desire for my gods, O Abraham?  If you do not desist, I will surely stone you, so avoid me a prolonged time.\"',verse: 2165,},ayah_47: {image: '',text: '[Abraham] said, \"Peace will be upon you. I will ask forgiveness for you of my Lord. Indeed, He is ever gracious to me.',verse: 2166,},ayah_48: {image: '',text: 'And I will leave you and those you invoke other than Allah and will invoke my Lord.  I expect that I will not be in invocation to my Lord unhappy.\"',verse: 2167,},ayah_49: {image: '',text: 'So when he had left them and those they worshipped other than Allah, We gave him Isaac and Jacob, and each [of them] We made a prophet.',verse: 2168,},ayah_50: {image: '',text: 'And We gave them of Our mercy, and we made for them a reputation of high honor.',verse: 2169,},ayah_51: {image: '',text: 'And mention in the Book, Moses. Indeed, he was chosen, and he was a messenger and a prophet.',verse: 2170,},ayah_52: {image: '',text: 'And We called him from the side of the mount at [his] right and brought him near, confiding [to him].',verse: 2171,},ayah_53: {image: '',text: 'And We gave him out of Our mercy his brother Aaron as a prophet.',verse: 2172,},ayah_54: {image: '',text: 'And mention in the Book, Ishmael. Indeed, he was true to his promise, and he was a messenger and a prophet.',verse: 2173,},ayah_55: {image: '',text: 'And he used to enjoin on his people prayer and zakah and was to his Lord pleasing.',verse: 2174,},ayah_56: {image: '',text: 'And mention in the Book, Idrees. Indeed, he was a man of truth and a prophet.',verse: 2175,},ayah_57: {image: '',text: 'And We raised him to a high station.',verse: 2176,},ayah_58: {image: '',text: 'Those were the ones upon whom Allah bestowed favor from among the prophets of the descendants of Adam and of those We carried [in the ship] with Noah, and of the descendants of Abraham and Israel, and of those whom We guided and chose.  When the verses of the Most Merciful were recited to them, they fell in prostration and weeping.',verse: 2177,},ayah_59: {image: '',text: 'But there came after them successors who neglected prayer and pursued desires; so they are going to meet evil -',verse: 2178,},ayah_60: {image: '',text: 'Except those who repent, believe and do righteousness; for those will enter Paradise and will not be wronged at all.',verse: 2179,},ayah_61: {image: '',text: '[Therein are] gardens of perpetual residence which the Most Merciful has promised His servants in the unseen. Indeed, His promise has ever been coming.',verse: 2180,},ayah_62: {image: '',text: 'They will not hear therein any ill speech -  only [greetings of] peace -  and they will have their provision therein, morning and afternoon.',verse: 2181,},ayah_63: {image: '',text: 'That is Paradise, which We give as inheritance to those of Our servants who were fearing of Allah .',verse: 2182,},ayah_64: {image: '',text: '[Gabriel said], \"And we [angels] descend not except by the order of your Lord. To Him belongs that before us and that behind us and what is in between.  And never is your Lord forgetful -',verse: 2183,},ayah_65: {image: '',text: 'Lord of the heavens and the earth and whatever is between them -  so worship Him and have patience for His worship.  Do you know of any similarity to Him?\"',verse: 2184,},ayah_66: {image: '',text: 'And the disbeliever says, \"When I have died, am I going to be brought forth alive?\"',verse: 2185,},ayah_67: {image: '',text: 'Does man not remember that We created him before, while he was nothing?',verse: 2186,},ayah_68: {image: '',text: 'So by your Lord, We will surely gather them and the devils; then We will bring them to be present around Hell upon their knees.',verse: 2187,},ayah_69: {image: '',text: 'Then We will surely extract from every sect those of them who were worst against the Most Merciful in insolence.',verse: 2188,},ayah_70: {image: '',text: 'Then, surely it is We who are most knowing of those most worthy of burning therein.',verse: 2189,},ayah_71: {image: '',text: 'And there is none of you except he will come to it. This is upon your Lord an inevitability decreed.',verse: 2190,},ayah_72: {image: '',text: 'Then We will save those who feared Allah and leave the wrongdoers within it, on their knees.',verse: 2191,},ayah_73: {image: '',text: 'And when Our verses are recited to them as clear evidences, those who disbelieve say to those who believe, \"Which of [our] two parties is best in position and best in association?\"',verse: 2192,},ayah_74: {image: '',text: 'And how many a generation have We destroyed before them who were better in possessions and [outward] appearance?',verse: 2193,},ayah_75: {image: '',text: 'Say, \"Whoever is in error -  let the Most Merciful extend for him an extension [in wealth and time] until, when they see that which they were promised -  either punishment [in this world] or the Hour [of resurrection] -  they will come to know who is worst in position and weaker in soldiers.\"',verse: 2194,},ayah_76: {image: '',text: 'And Allah increases those who were guided, in guidance, and the enduring good deeds are better to your Lord for reward and better for recourse.',verse: 2195,},ayah_77: {image: '',text: 'Then, have you seen he who disbelieved in Our verses and said, \"I will surely be given wealth and children [in the next life]?\"',verse: 2196,},ayah_78: {image: '',text: 'Has he looked into the unseen, or has he taken from the Most Merciful a promise?',verse: 2197,},ayah_79: {image: '',text: 'No! We will record what he says and extend for him from the punishment extensively.',verse: 2198,},ayah_80: {image: '',text: 'And We will inherit him [in] what he mentions, and he will come to Us alone.',verse: 2199,},ayah_81: {image: '',text: 'And they have taken besides Allah [false] deities that they would be for them [a source of] honor.',verse: 2200,},ayah_82: {image: '',text: 'No! Those \"gods\" will deny their worship of them and will be against them opponents [on the Day of Judgement].',verse: 2201,},ayah_83: {image: '',text: 'Do you not see that We have sent the devils upon the disbelievers, inciting them to [evil] with [constant] incitement?',verse: 2202,},ayah_84: {image: '',text: 'So be not impatient over them.  We only count out to them a [limited] number.',verse: 2203,},ayah_85: {image: '',text: 'On the Day We will gather the righteous to the Most Merciful as a delegation',verse: 2204,},ayah_86: {image: '',text: 'And will drive the criminals to Hell in thirst',verse: 2205,},ayah_87: {image: '',text: 'None will have [power of] intercession except he who had taken from the Most Merciful a covenant.',verse: 2206,},ayah_88: {image: '',text: 'And they say, \"The Most Merciful has taken [for Himself] a son.\"',verse: 2207,},ayah_89: {image: '',text: 'You have done an atrocious thing.',verse: 2208,},ayah_90: {image: '',text: 'The heavens almost rupture therefrom and the earth splits open and the mountains collapse in devastation',verse: 2209,},ayah_91: {image: '',text: 'That they attribute to the Most Merciful a son.',verse: 2210,},ayah_92: {image: '',text: 'And it is not appropriate for the Most Merciful that He should take a son.',verse: 2211,},ayah_93: {image: '',text: 'There is no one in the heavens and earth but that he comes to the Most Merciful as a servant.',verse: 2212,},ayah_94: {image: '',text: 'He has enumerated them and counted them a [full] counting.',verse: 2213,},ayah_95: {image: '',text: 'And all of them are coming to Him on the Day of Resurrection alone.',verse: 2214,},ayah_96: {image: '',text: 'Indeed, those who have believed and done righteous deeds -  the Most Merciful will appoint for them affection.',verse: 2215,},ayah_97: {image: '',text: 'So, [O Muhammad], We have only made Qur'an easy in the Arabic language that you may give good tidings thereby to the righteous and warn thereby a hostile people.',verse: 2216,},ayah_98: {image: '',text: 'And how many have We destroyed before them of generations? Do you perceive of them anyone or hear from them a sound?',verse: 2217,},name: surah_19,};"}
